RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_glb.c
    uint32_t tmpValCfg0 = 0;
    uint32_t tmpValCfg1 = 0;
    uint32_t tmpValCfg2 = 0;
    uint32_t targetBit = 0;
    uint64_t targetVal = 0;

    tmpValCfg0 = BL_RD_REG(GLB_BASE, GLB_CGEN_CFG0);
    tmpValCfg1 = BL_RD_REG(GLB_BASE, GLB_CGEN_CFG1);
    tmpValCfg2 = BL_RD_REG(GLB_BASE, GLB_CGEN_CFG2);
    for (uint8_t i = 0; i < 64; i++) {
        targetBit = 0;
        switch (i) {
            case GLB_AHB_CLOCK_IP_CPU:
                targetBit = tmpValCfg0 & (1 << 0);
                break;
            case GLB_AHB_CLOCK_IP_SDU:
                targetBit = tmpValCfg0 & (1 << 1);
                break;
            case GLB_AHB_CLOCK_IP_SEC:
                targetBit = (tmpValCfg0 & (1 << 2)) && (tmpValCfg1 & (1 << 3)) && (tmpValCfg1 & (1 << 4));
                break;
            case GLB_AHB_CLOCK_IP_DMA_0:
                targetBit = (tmpValCfg0 & (1 << 3)) && (tmpValCfg1 & (1 << 12));
                break;
            case GLB_AHB_CLOCK_IP_DMA_1:
                break;
            case GLB_AHB_CLOCK_IP_DMA_2:
                break;
            case GLB_AHB_CLOCK_IP_CCI:
                targetBit = tmpValCfg0 & (1 << 4);
                break;
            case GLB_AHB_CLOCK_IP_RF_TOP:
                break;
            case GLB_AHB_CLOCK_IP_GPIP:
                targetBit = tmpValCfg1 & (1 << 2);
                break;
            case GLB_AHB_CLOCK_IP_TZC:
                targetBit = tmpValCfg1 & (1 << 5);
                break;
            case GLB_AHB_CLOCK_IP_EF_CTRL:
                targetBit = tmpValCfg1 & (1 << 7);
                break;
            case GLB_AHB_CLOCK_IP_SF_CTRL:
                targetBit = tmpValCfg1 & (1 << 11);
                break;
            case GLB_AHB_CLOCK_IP_EMAC:
                targetBit = tmpValCfg1 & (1 << 13);
                break;
            case GLB_AHB_CLOCK_IP_UART0:
                targetBit = tmpValCfg1 & (1 << 16);
                break;
            case GLB_AHB_CLOCK_IP_UART1:
                targetBit = tmpValCfg1 & (1 << 17);
                break;
            case GLB_AHB_CLOCK_IP_UART2:
                break;
            case GLB_AHB_CLOCK_IP_UART3:
                break;
            case GLB_AHB_CLOCK_IP_UART4:
                break;
            case GLB_AHB_CLOCK_IP_SPI:
                targetBit = tmpValCfg1 & (1 << 18);
                break;
            case GLB_AHB_CLOCK_IP_I2C:
                targetBit = tmpValCfg1 & (1 << 19);
                break;
            case GLB_AHB_CLOCK_IP_PWM:
                targetBit = tmpValCfg1 & (1 << 20);
                break;
            case GLB_AHB_CLOCK_IP_TIMER:
                targetBit = tmpValCfg1 & (1 << 21);
                break;
            case GLB_AHB_CLOCK_IP_IR:
                targetBit = tmpValCfg1 & (1 << 22);
                break;
            case GLB_AHB_CLOCK_IP_CHECKSUM:
                targetBit = tmpValCfg1 & (1 << 23);
                break;
            case GLB_AHB_CLOCK_IP_QDEC:
                targetBit = (tmpValCfg1 & (1 << 24)) && (tmpValCfg1 & (1 << 25)) && (tmpValCfg1 & (1 << 26));
                break;
            case GLB_AHB_CLOCK_IP_KYS:
                targetBit = tmpValCfg1 & (1 << 27);
                break;
            case GLB_AHB_CLOCK_IP_I2S:
                targetBit = tmpValCfg1 & (1 << 26);
                break;
            case GLB_AHB_CLOCK_IP_USB11:
                targetBit = tmpValCfg1 & (1 << 28);
                break;
            case GLB_AHB_CLOCK_IP_CAM:
                targetBit = tmpValCfg1 & (1 << 29);
                break;
            case GLB_AHB_CLOCK_IP_MJPEG:
                targetBit = tmpValCfg1 & (1 << 30);
                break;
            case GLB_AHB_CLOCK_IP_BT_BLE_NORMAL:
                targetBit = (tmpValCfg2 & (1 << 0)) && (tmpValCfg2 & (1 << 4));
                break;
            case GLB_AHB_CLOCK_IP_BT_BLE_LP:
                break;
            case GLB_AHB_CLOCK_IP_ZB_NORMAL:
                targetBit = tmpValCfg2 & (1 << 0);
                break;
            case GLB_AHB_CLOCK_IP_ZB_LP:
                break;
            case GLB_AHB_CLOCK_IP_WIFI_NORMAL:
                break;
            case GLB_AHB_CLOCK_IP_WIFI_LP:
                break;
            case GLB_AHB_CLOCK_IP_BT_BLE_2_NORMAL:
                break;
            case GLB_AHB_CLOCK_IP_BT_BLE_2_LP:
                break;
            case GLB_AHB_CLOCK_IP_EMI_MISC:
                break;
            case GLB_AHB_CLOCK_IP_PSRAM0_CTRL:
                break;
            case GLB_AHB_CLOCK_IP_PSRAM1_CTRL:
                break;
            case GLB_AHB_CLOCK_IP_USB20:
                break;
            case GLB_AHB_CLOCK_IP_MIX2:
                break;
            case GLB_AHB_CLOCK_IP_AUDIO:
                break;
            case GLB_AHB_CLOCK_IP_SDH:
                break;
            default:
                break;
        }
        if (!targetBit) {
            targetVal |= ((uint64_t)1 << i);
        }
    }

    return targetVal;
}

/****************************************************************************/ /**
 * @brief  get first 1 from u64, then clear it
 *
 * @param  val: target value
 * @param  bit: first 1 in bit
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
static BL_Err_Type GLB_Get_And_Clr_First_Set_From_U64(uint64_t *val, uint32_t *bit)
{
    if (!*val) {
        return ERROR;
    }

    for (uint8_t i = 0; i < 64; i++) {
        if ((*val) & ((uint64_t)1 << i)) {
            *bit = i;
            (*val) &= ~((uint64_t)1 << i);
            break;
        }
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  hold IPs clock
 *
 * @param  ips: GLB_AHB_CLOCK_IP_xxx | GLB_AHB_CLOCK_IP_xxx | ......
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_PER_Clock_Gate(uint64_t ips)
{
    /* api request from cjy */

