RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/src/bl702_glb.c
    tmpVal = BL_RD_REG(GLB_BASE, GLB_WIFI_BT_COEX_CTRL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_COEX_BT_BW, bandWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_COEX_BT_PTI, pti);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_COEX_BT_CHANNEL, channel);
    BL_WR_REG(GLB_BASE, GLB_WIFI_BT_COEX_CTRL, tmpVal);

    tmpVal = BL_RD_REG(GLB_BASE, GLB_WIFI_BT_COEX_CTRL);
    if (enable) {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_EN_GPIO_BT_COEX, 1);
    } else {
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_EN_GPIO_BT_COEX, 0);
    }
    BL_WR_REG(GLB_BASE, GLB_WIFI_BT_COEX_CTRL, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Select UART signal function
 *
 * @param  sig: UART signal
 * @param  fun: UART function
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_UART_Fun_Sel(GLB_UART_SIG_Type sig, GLB_UART_SIG_FUN_Type fun)
{
    uint32_t sig_pos = 0;
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_UART_SIG_TYPE(sig));
    CHECK_PARAM(IS_GLB_UART_SIG_FUN_TYPE(fun));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_UART_SIG_SEL_0);
    sig_pos = (sig * 4);
    /* Clear original val */
    tmpVal &= (~(0xf << sig_pos));
    /* Set new value */
    tmpVal |= (fun << sig_pos);
    BL_WR_REG(GLB_BASE, GLB_UART_SIG_SEL_0, tmpVal);

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  power off DLL
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Power_Off_DLL(void)
{
    uint32_t tmpVal = 0;

    /* GLB->dll.BF.ppu_dll = 0;   */
    /* GLB->dll.BF.pu_dll = 0;    */
    /* GLB->dll.BF.dll_reset = 1; */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PPU_DLL, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PU_DLL, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_RESET, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  power on DLL
 *
 * @param  xtalType: DLL xtal type
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Power_On_DLL(GLB_DLL_XTAL_Type xtalType)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DLL_XTAL_TYPE(xtalType));

    /* GLB->dll.BF.dll_refclk_sel = XXX; */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    switch (xtalType) {
        case GLB_DLL_XTAL_NONE:
            return ERROR;
        case GLB_DLL_XTAL_32M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_REFCLK_SEL, 0);
            break;
        case GLB_DLL_XTAL_RC32M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_REFCLK_SEL, 1);
            break;
        default:
            break;
    }
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    /* GLB->dll.BF.dll_prechg_sel = 1;   */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_PRECHG_SEL, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    /* GLB->dll.BF.ppu_dll = 1;   */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PPU_DLL, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    BL702_Delay_US(2);

    /* GLB->dll.BF.pu_dll = 1; */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_PU_DLL, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    BL702_Delay_US(2);

    /* GLB->dll.BF.dll_reset = 0; */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_RESET, 0);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    /* delay for settling */
    BL702_Delay_US(5);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  enable all DLL output clock
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Enable_DLL_All_Clks(void)
{
    uint32_t tmpVal = 0;

    /* GLB->dll.WORD = GLB->dll.WORD | 0x000000f8; include 288m and mmdiv */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_57P6M_EN, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_96M_EN, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_144M_EN, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_288M_EN, 1);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_MMDIV_EN, 1);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  enable one of DLL output clock
 *
 * @param  dllClk: None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Enable_DLL_Clk(GLB_DLL_CLK_Type dllClk)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DLL_CLK_TYPE(dllClk));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    switch (dllClk) {
        case GLB_DLL_CLK_57P6M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_57P6M_EN, 1);
            break;
        case GLB_DLL_CLK_96M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_96M_EN, 1);
            break;
        case GLB_DLL_CLK_144M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_144M_EN, 1);
            break;
        case GLB_DLL_CLK_288M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_288M_EN, 1);
            break;
        case GLB_DLL_CLK_MMDIV:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_MMDIV_EN, 1);
            break;
        default:
            break;
    }
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  disable all DLL output clock
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Disable_DLL_All_Clks(void)
{
    uint32_t tmpVal = 0;

    /* GLB->dll.WORD = GLB->dll.WORD & ~0x000000f8; */
    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_57P6M_EN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_96M_EN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_144M_EN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_288M_EN, 0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_MMDIV_EN, 0);
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  disable one of DLL output clock
 *
 * @param  dllClk: None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_CLOCK_SECTION GLB_Disable_DLL_Clk(GLB_DLL_CLK_Type dllClk)
{
    uint32_t tmpVal = 0;

    CHECK_PARAM(IS_GLB_DLL_CLK_TYPE(dllClk));

    tmpVal = BL_RD_REG(GLB_BASE, GLB_DLL);
    switch (dllClk) {
        case GLB_DLL_CLK_57P6M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_57P6M_EN, 0);
            break;
        case GLB_DLL_CLK_96M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_96M_EN, 0);
            break;
        case GLB_DLL_CLK_144M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_144M_EN, 0);
            break;
        case GLB_DLL_CLK_288M:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_288M_EN, 0);
            break;
        case GLB_DLL_CLK_MMDIV:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_DLL_CLK_MMDIV_EN, 0);
            break;
        default:
            break;
    }
    BL_WR_REG(GLB_BASE, GLB_DLL, tmpVal);

    return SUCCESS;
}
#endif

/****************************************************************************/ /**
 * @brief  Select ir rx gpio (gpio17~gpio31)
 *
 * @param  gpio: IR gpio selected
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_IR_RX_GPIO_Sel(GLB_GPIO_Type gpio)
{
    uint32_t tmpVal = 0;

    /* Select gpio between gpio17 and gpio31 */
    if (gpio > 16 && gpio < 32) {
        tmpVal = BL_RD_REG(GLB_BASE, GLB_LED_DRIVER);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal, GLB_IR_RX_GPIO_SEL, gpio - 16);
        BL_WR_REG(GLB_BASE, GLB_LED_DRIVER, tmpVal);
    }

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  Enable ir led driver
 *
 * @param  None
 *
 * @return SUCCESS or ERROR
 *
*******************************************************************************/
BL_Err_Type GLB_IR_LED_Driver_Enable(void)
{
    uint32_t tmpVal = 0;

